package org.example.lesson4.hw;

public class Box /* <FIXME: Указать дженерик> */{

    // Реализовать хранение фруктов в коробке.
    // Должны быть доступны следующие возможности
    // Добавление фрукта
    // Должен быть конструктор
    // Метод, который пересыпает фрукты из текущей коробки в другую коробку
    // Для внутреннего хранения можно использовать например List

//    private List list;

    public void add(Object fruit) {
        // TODO: 24.01.2023
    }
    
    public double getWeight() {
        // TODO: 24.01.2023 Просуммировать веса всех фруктов в коробке
        return 0.0;
    }

    public void moveTo(Box /* <FIXME: Указать дженерик> */ anotherBox) {
        // TODO: 24.01.2023
        // Пересыпать фрукты из текущей коробки в anotherBox
    }

}
